boaschti/ESP8266-Server/ESPServer.h

//This Code generates a Webserver on ES8266 which provides
//- every value is changeable via browser
//- Ota setup via browser file upload with Password
//- MQTT connection
//- setup pages incl placeholder for a userconfigpage (handleconfigureUserWrite() and handleconfigureUser())
//- mdns setup
//- you can use pGC->tx_topic, pGC->rx_topic in you main code
//- you can create a UserSubscribe() funktion to make your own subscribe code
//- you can create a MQTTBrokerChanged() funktion



//- you only have to include this File and call setup_server()
//- you have to make a funktion to get messages: void callback(char* topic, byte* payload, unsigned int length) {}



#define SERIAL_BAUD   115200

#include "ESPServerDefines.h"

#include <ESP8266WiFi.h>
#include <pgmspace.h>
#include <PubSubClient.h>

#ifndef DeviceName
  #define DeviceName "DeviceName"
#endif

#ifndef UserPageName
  #define UserPageName "UserPage"
#endif

#ifndef MQTTBrokerChanged_existing
  #define MqttBrokerChangedMsg "nothing to do!"
#endif

#ifndef MqttBrokerChangedMsg
  #define MqttBrokerChangedMsg "No Message defined"
#endif

// Default values
const char PROGMEM MDNS_NAME[] = DeviceName;
const char PROGMEM MQTTCLIENTNAME[] = DeviceName;
const char PROGMEM MQTT_BROKER[] = "none"; // none = mqtt off
const char PROGMEM RX_TOPIC[] = DeviceName"/set/#";
const char PROGMEM TX_TOPIC[] = DeviceName"/state";
const char PROGMEM AP_NAME[] = DeviceName"-AP";

//Passwort und Benutzer zum Softwareupdate ueber Browser
const char PROGMEM UPDATEUSER[]		  = "B";
const char PROGMEM UPDATEPASSWORD[] =	"B";
const char PROGMEM MQTTPASSWORD[]   = "B";
const char PROGMEM MQTTUSER[]   = "B";

#ifndef showKeysInWeb
  #define showKeysInWeb false
#endif

#define HiddenString "xxx"

WiFiClient espClient;
PubSubClient mqttClient(espClient);

// vvvvvvvvv Global Configuration vvvvvvvvvvv
#include <EEPROM.h>

void callback(char* topic, byte* payload, unsigned int length);


UserEEPromSetup_mt UserEEPromSetupCallback = (UserEEPromSetup_mt)null;
UserEEPromChecksum_mt UserEEPromChecksumCallback = (UserEEPromChecksum_mt)null;
uint32_t UserEEPromAdditioanlSize = 0;
void* endOfEepromServerData;





#ifdef MQTTBrokerChanged_existing
    void MQTTBrokerChanged();
#endif 

#ifdef usersubscribe_existing
    void UserSubscribe();
#endif

struct _GLOBAL_CONFIG {
    uint32_t    checksum;
    char        apname[32];
    char        mqttbroker[32];
    char        mqttclientname[32];
    char        rx_topic[32];
    char        tx_topic[32];
    char        mdnsname[32];
    uint32_t    ipaddress;  // if 0, use DHCP
    uint32_t    ipnetmask;
    uint32_t    ipgateway;
    uint32_t    ipdns1;
    uint32_t    ipdns2;
    char        updateUser[20];
    char        updatePassword[20];
    char        mqttPassword[20];
    char        mqttUser[20];  
    uint8_t     userMem8[50];
    uint32_t    userMem32[20];
};

struct _GLOBAL_CONFIG *pGC;
// ^^^^^^^^^ Global Configuration ^^^^^^^^^^^

// vvvvvvvvv ESP8266 WiFi vvvvvvvvvvv
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include "WiFiManager.cpp"          //https://github.com/tzapu/WiFiManager
#include "WiFiManager.h"          //https://github.com/tzapu/WiFiManager


WiFiManager wifiManager;

boolean DeviceEnteredConfigAp = false;

void configModeCallback (WiFiManager *myWiFiManager) {
    Serial.println("SW: Entered AP to config");
    DeviceEnteredConfigAp = true;
}

void wifi_setup(void) {
  //WiFiManager
  //Local intialization. Once its business is done, there is no need to keep it around
  //reset settings - for testing. Wipes out SSID/password.
  //wifiManager.resetSettings();
 
  
  //set callback that gets called when connecting to previous WiFi fails, and enters Access Point mode
  wifiManager.setAPCallback(configModeCallback);

  //fetches ssid and pass and tries to connect
  //if it does not connect it starts an access point with the specified name
  //here  "AutoConnectAP"
  //and goes into a blocking loop awaiting configuration
  /*
  #ifdef AllowAcessPoint
      wifiManager.setConfigPortalTimeout(180);
  #else
      // try to connect 3 times then go in a blocking loop for config AP
      wifiManager.setConfigPortalTimeout(1);
      if(!wifiManager.autoConnect(pGC->apname)){
        
      }
      wifiManager.setConfigPortalTimeout(180);
  #endif
  
  wifiManager.setConfigPortalTimeout(1);
  */
  
  
  
  wifiManager.setConfigPortalTimeout(1);
  
  uint8_t i = 0;
  bool connected = false;
  while((i <= 4)) {
    i++;
    Serial.println("SW: Try to connect");
    
    //if (wifiManager.autoConnect(pGC->apname)){
    if (wifiManager.connectWifi("","") == WL_CONNECTED){
        connected = true;
        Serial.println("SW: connected to saved WLAN dont try again");
        break;        
    }else{
        DeviceEnteredConfigAp = false;
    }
  }
  
  if (!connected){
      Serial.println("SW: start Config Portal because we have no connection to saved wlan");
      wifiManager.setConfigPortalTimeout(360);
      wifiManager.autoConnect(pGC->apname);
  }
  
  // if AP is active we have to reset the Gateway because the wifimanager sends a open AP
  if (DeviceEnteredConfigAp){
      #ifndef AllowAcessPoint
          #ifndef WiFiNotRequired
              WiFi.mode(WIFI_STA); //see https://github.com/kentaylor/WiFiManager/blob/master/examples/ConfigOnSwitch/ConfigOnSwitch.ino#L46
              Serial.println("SW: reset cause: AP is active");
              Serial.println("SW: Wait 10 seconds");
              //Serial.print("current IP: ");
              //Serial.println(wifiManager.localIP());
              //Serial.println(WiFi.localIP();
              delay(5000);
              // ESP.reset dont works first time after serial flashing
              ESP.reset();
              while(1);
          #else
              Serial.println("SW: Switch Wifi off. Run Programm.");
              WiFi.mode(WIFI_OFF);
          #endif
      #else
          Serial.println("SW: not connected to saved WLAN. Run Programm.");
      #endif
  }else{
      Serial.println("SW: connected to saved WLAN");
      WiFi.mode(WIFI_STA); //see https://github.com/kentaylor/WiFiManager/blob/master/examples/ConfigOnSwitch/ConfigOnSwitch.ino#L46
  }
}

// ^^^^^^^^^ ESP8266 WiFi ^^^^^^^^^^^

// vvvvvvvvv Global Configuration vvvvvvvvvvv
uint32_t gc_checksum() {
    uint8_t *p = (uint8_t *)pGC;
    uint32_t checksum = 0;
    p += sizeof(pGC->checksum);
    for (size_t i = 0; i < (sizeof(*pGC) - 4); i++) {
        checksum += *p++;
    }
    
