boaschti/ESP8266-Server/ESPServer.h
    if (UserEEPromChecksumCallback != NULL)
    {
        checksum = UserEEPromChecksumCallback(checksum, p);
    }
    
    return checksum;
}

void SaveEEpromData(){
    pGC->checksum = gc_checksum();
    EEPROM.commit();
}


void eeprom_setup() {
    EEPROM.begin(4096);
    pGC = (struct _GLOBAL_CONFIG *)EEPROM.getDataPtr();

    endOfEepromServerData = ((uint8_t*)pGC) + sizeof(*pGC);

    // if checksum bad init GC else use GC values
    if (gc_checksum() != pGC->checksum) {
    //if (1){  
        Serial.println("Factory reset");
        memset(pGC, 0, sizeof(*pGC) + UserEEPromAdditioanlSize);
        Serial.println("AP_NAME");
        strcpy_P(pGC->apname, AP_NAME);
        Serial.println("MQTT_BROKER");
        strcpy_P(pGC->mqttbroker, MQTT_BROKER);
        Serial.println("copy topics");
        strcpy_P(pGC->rx_topic, RX_TOPIC);
        strcpy_P(pGC->tx_topic, TX_TOPIC);
        Serial.println("MDNS_NAME");
        strcpy_P(pGC->mdnsname, MDNS_NAME);
        Serial.println("mqttclientname");
        //bei der folgenden Zeile haengt sich der Chip auf: Exception (28)
        //strcpy(pGC->mqttclientname, WiFi.hostname().c_str());
        strncpy_P(pGC->mqttclientname, MQTTCLIENTNAME,32);
        Serial.println("UPDATEPW");
        strncpy_P(pGC->updateUser, UPDATEUSER, 20);
        strncpy_P(pGC->updatePassword, UPDATEPASSWORD, 20);    
        strncpy_P(pGC->mqttUser, MQTTUSER, 20);
        strncpy_P(pGC->mqttPassword, MQTTPASSWORD, 20);

        if (UserEEPromSetupCallback != NULL)
        {
            Serial.println("UserEEPromSetup");
            UserEEPromSetupCallback(endOfEepromServerData);
        }

        Serial.println("checksum");
        pGC->checksum = gc_checksum();
        Serial.println("EEPROM.commit");
        EEPROM.commit();   
    }
}

uint8_t eeprom_read_byte(uint16_t address){
    return 0;
    //return pGC->userMem[address];
}

uint8_t eeprom_write_byte(uint16_t address, uint8_t value){
    //pGC->userMem[address] = value;
    pGC->checksum = gc_checksum();
    //EEPROM.commit();
    return 0;
    //return pGC->userMem[address];
}

// ^^^^^^^^^ Global Configuration ^^^^^^^^^^^

// vvvvvvvvv ESP8266 web sockets vvvvvvvvvvv
#include <ESP8266mDNS.h>


MDNSResponder mdns;

void mdns_setup(void) {
    if (pGC->mdnsname[0] == '\0') return;
    
    WiFi.hostname(pGC->mdnsname);
    
    //if (mdns.begin(pGC->mdnsname, WiFi.localIP())) {
    if (mdns.begin(pGC->mdnsname)){
        Serial.println("MDNS responder started");
        mdns.addService("http", "tcp", 80);
        mdns.addService("ws", "tcp", 81);
    }else{
        Serial.println("MDNS.begin failed");
    }
    Serial.printf("Connect to http://%s.local or http://", pGC->mdnsname);
    Serial.println(WiFi.localIP());
}


static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
<meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
<title>)rawliteral"DeviceName R"rawliteral(</title>
<style>
"body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
</style>
<h2>)rawliteral"DeviceName R"rawliteral(</h2>
<div id="configureDeviceName">
  <p><a href="/configDevice"><button type="button">Configure )rawliteral"DeviceName R"rawliteral(</button></a>
</div>
<div id="configureUserPage">
  <p><a href="/configUserPage"><button type="button">Configure )rawliteral"UserPageName R"rawliteral(</button></a>
</div>
<div id="FirmwareUpdate">
  <p><a href="/updater"><button type="button">Update Firmware</button></a>
</div>
</body>
</html>
)rawliteral";

static const char PROGMEM CONFIGURE_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>)rawliteral"DeviceName R"rawliteral( Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h2>)rawliteral"DeviceName R"rawliteral( Configuration</h2>
  <a href="/configDiv"><button type="button">Diverse</button></a>
  <p>
  <a href="/configMqtt"><button type="button">MQTT</button></a>
  <p>
  <a href="/"><button type="button">Home</button></a>
</body>
</html>
)rawliteral";

static const char PROGMEM CONFIGUREDIV_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>)rawliteral"DeviceName R"rawliteral( Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h3>)rawliteral"DeviceName R"rawliteral( Configuration</h3>
  <form method='POST' action='/configDiv' enctype='multipart/form-data'>
    <label>Access Point name</label>
    <input type='text' name='apname' value="%s" size="32" maxlength="32"><br>
    <label>DNS name</label>
    <input type='text' name='mdnsname' value="%s" size="32" maxlength="32"><br>
    <label>Updater password:</label><br>
    <label>old user</label>
    <input type='text' name='olduser' value="%s" size="20" maxlength="20"><br>
    <label>old password</label>
    <input type='text' name='oldpassword' value="%s" size="20" maxlength="20"><br>
    <label>new user</label>
    <input type='text' name='newuser' size="20" maxlength="20"><br>
    <label>new password</label>
    <input type='text' name='newpassword' size="20" maxlength="20"><br>
    <p><input type='submit' value='Save changes'>
  </form>
  <p><a href="/configDevice"><button type="button">Cancel</button></a><a href="/configReset"><button type="button">Reset Settings</button></a><a href="/configWifiMan"><button type="button">Reset WIFI</button></a><a href="/configReboot"><button type="button">Reboot</button></a><br>
  Reset or Reboot: Close browser tab because browser will fire action again!
</body>
</html> 
)rawliteral";

static const char PROGMEM CONFIGUREMQTT_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>)rawliteral"DeviceName R"rawliteral( MQTT Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h3>)rawliteral"DeviceName R"rawliteral( MQTT Configuration</h3>
  <form method='POST' action='/configMqtt' enctype='multipart/form-data'>
    <label>MQTT broker (none = off)</label>
    <input type='text' name='mqttbroker' value="%s" size="32" maxlength="32"><br>
    <label>MQTT client name</label>
    <input type='text' name='mqttclientname' value="%s" size="32" maxlength="32"><br>
    <label>MQTT client user</label>
    <input type='text' name='mqttclientuser' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client password</label>
    <input type='text' name='mqttclientpassword' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client Tx Topic</label>
    <input type='text' name='mqttclienttxtopic' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client Rx Topic</label>
    <input type='text' name='mqttclientrxtopic' value="%s" size="32" maxlength="20"><br>    
    <label>Note: If you have seen %s and changed MQTT broker then follow the message below!</label><br> 
    <label>)rawliteral"MqttBrokerChangedMsg R"rawliteral(</label>
    <p><input type='submit' value='Save changes'>
  </form>
  <p><a href="/configDevice"><button type="button">Cancel</button></a>
</body>
</html>
)rawliteral";

