boaschti/ESP8266-Server/ESPServer.h
#ifndef userpage_existing 
    static const char PROGMEM USERPAGE_HTML[] = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
      <title>Dummy User Page</title>
      <style>
        "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
      </style>
    </head>
    <body>
      <h3>No Userpage defined or #define userpage_existing not set!</h3>
      <a href="/"><button type="button">Home</button></a>
    </body>
    </html>
    )rawliteral";
#endif

#include <WebSocketsServer.h>     //https://github.com/Links2004/arduinoWebSockets
#include <Hash.h>
ESP8266WebServer webServer(80);
WebSocketsServer webSocket = WebSocketsServer(81);

void webSocketEvent(uint8_t num, int type, uint8_t * payload, size_t length)
{
    Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);
    switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\r\n", num);
      break;
    case WStype_CONNECTED:
      {
        IPAddress ip = webSocket.remoteIP(num);
        Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
      }
      break;
    case WStype_TEXT:
      Serial.printf("[%u] get Text: %s\r\n", num, payload);

      // send data to all connected clients
      //webSocket.broadcastTXT(payload, length);
      break;
    case WStype_BIN:
      Serial.printf("[%u] get binary length: %u\r\n", num, length);
      //hexdump(payload, length);

      // echo data back to browser
      //webSocket.sendBIN(num, payload, length);
      break;
    default:
      Serial.printf("Invalid WStype [%d]\r\n", type);
      break;
    }
}

void handleRoot()
{
    Serial.print("Free heap="); Serial.println(ESP.getFreeHeap());
    
    webServer.send_P(200, "text/html", INDEX_HTML);
}

void handleNotFound()
{
    String message = "File Not Found\n\n";
    message += "URI: ";
    message += webServer.uri();
    message += "\nMethod: ";
    message += (webServer.method() == HTTP_GET)?"GET":"POST";
    message += "\nArguments: ";
    message += webServer.args();
    message += "\n";
    for (uint8_t i=0; i<webServer.args(); i++){
        message += " " + webServer.argName(i) + ": " + webServer.arg(i) + "\n";
    }
    webServer.send(404, "text/plain", message);
}

void handleconfigureDevice()
{
    webServer.send_P(200, "text/html", CONFIGURE_HTML);
}

// Reset global device config back to factory defaults
void handleconfigureReset()
{
    pGC->checksum++;
    
    EEPROM.commit();
    ESP.reset();
    delay(1000);
}

// Reset global wifi config back to factory defaults
void handleResetWifiManager()
{
    wifiManager.resetSettings();
    ESP.reset();
    delay(1000);
}

// Reboot
void handleReboot()
{
    ESP.reset();
    delay(1000);
}

void handleconfigureDiv()
{
    size_t formFinal_len = strlen_P(CONFIGUREDIV_HTML) + sizeof(*pGC);
    char *formFinal = (char *)malloc(formFinal_len);
    if (formFinal == NULL) {
        Serial.println("formFinal malloc failed");
        return;
    }
    #if showKeysInWeb == true
      snprintf_P(formFinal, formFinal_len, CONFIGUREDIV_HTML,
          pGC->apname, pGC->mdnsname, pGC->updateUser, pGC->updatePassword
          );
    #else
      snprintf_P(formFinal, formFinal_len, CONFIGUREDIV_HTML,
          pGC->apname, pGC->mdnsname, HiddenString, HiddenString
          );
    #endif
    webServer.send(200, "text/html", formFinal);
    free(formFinal);
}

void handleconfigureDivWrite()
{
    bool commit_required = false;
    bool oldPasswordSeen = false;
    bool oldUserSeen = false;
    String argi, argNamei;

    for (uint8_t i=0; i<webServer.args(); i++) {
        Serial.print(webServer.argName(i));
        Serial.print('=');
        Serial.println(webServer.arg(i));
        argi = webServer.arg(i);
        argNamei = webServer.argName(i);
        if (argNamei == "apname") {
          const char *apname = argi.c_str();
            if (strcmp(apname, pGC->apname) != 0) {
                commit_required = true;
                strcpy(pGC->apname, apname);
            }
        }
        else if (argNamei == "olduser") {
            const char *olduser = argi.c_str();
            if (strcmp(olduser, HiddenString) != 0){
                if (strcmp(olduser, pGC->updateUser) == 0) {
                    oldUserSeen = true;
                }
            }
        }
        else if (argNamei == "oldpassword") {
            const char *oldpw = argi.c_str();
            if (strcmp(oldpw, HiddenString) != 0){
                if (strcmp(oldpw, pGC->updatePassword) == 0) {
                    oldPasswordSeen = true;
                }
            }
        }
        else if (argNamei == "newuser") {
          const char *newusr = argi.c_str();
            if ((strcmp(newusr, HiddenString) != 0) && oldPasswordSeen && oldUserSeen){
                if (strcmp(newusr, pGC->updatePassword) != 0) {
                    commit_required = true;
                    strcpy(pGC->updateUser, newusr);
                    Serial.println("user changed");
                }
            }
        }
        else if (argNamei == "newpassword") {
          const char *newpw = argi.c_str();
            if ((strcmp(newpw, HiddenString) != 0) && oldPasswordSeen && oldUserSeen){
                if (strcmp(newpw, pGC->updatePassword) != 0) {
                    commit_required = true;
                    strcpy(pGC->updatePassword, newpw);
                    Serial.println("password changed");
                }
            }
        }
        else if (argNamei == "mdnsname") {
            const char *mdns = argi.c_str();
            if (strcmp(mdns, pGC->mdnsname) != 0) {
                commit_required = true;
                strcpy(pGC->mdnsname, mdns);
            }
        }
    }
    handleRoot();
    if (commit_required) {
        pGC->checksum = gc_checksum();
        EEPROM.commit();
        ESP.reset();
        delay(1000);
    }
}

void handleconfigureMqtt()
{
    size_t formFinal_len = strlen_P(CONFIGUREMQTT_HTML) + sizeof(*pGC);
    char *formFinal = (char *)malloc(formFinal_len);
    if (formFinal == NULL) {}
    #if showKeysInWeb == true
        snprintf_P(formFinal, formFinal_len, CONFIGUREMQTT_HTML,
        pGC->mqttbroker, pGC->mqttclientname, pGC->mqttUser, pGC->mqttPassword, pGC->tx_topic, pGC->rx_topic, HiddenString
        );
    #else
        snprintf_P(formFinal, formFinal_len, CONFIGUREMQTT_HTML,
        HiddenString, pGC->mqttclientname,  HiddenString, HiddenString, pGC->tx_topic, pGC->rx_topic, HiddenString
        );
    #endif
    webServer.send(200, "text/html", formFinal);
    free(formFinal);
}

void handleconfigureMqttWrite()
{
    bool commit_required = false;
    String argi, argNamei;

