boaschti/ESP8266-Server/ESPServer.h
    for (uint8_t i=0; i<webServer.args(); i++) {
        Serial.print(webServer.argName(i));
        Serial.print('=');
        Serial.println(webServer.arg(i));
        argi = webServer.arg(i);
        argNamei = webServer.argName(i);
        if (argNamei == "mqttbroker") {
            const char *broker = argi.c_str();
            if (strcmp(broker, HiddenString) != 0){
                if (strcmp(broker, pGC->mqttbroker) != 0) {
                    commit_required = true;
                    strcpy(pGC->mqttbroker, broker);
                    #ifdef MQTTBrokerChanged_existing
                        MQTTBrokerChanged();
                    #endif
                }
            }
        }
        else if (argNamei == "mqttclientname") {
            const char *client = argi.c_str();
            if (strcmp(client, pGC->mqttclientname) != 0) {
                commit_required = true;
                strcpy(pGC->mqttclientname, client);
            }
        }
        else if (argNamei == "mqttclientpassword"){
            const char *pw = argi.c_str();
            if (strcmp(pw, HiddenString) != 0){
                if (strcmp(pw, pGC->mqttPassword) != 0){
                    commit_required = true;
                    strcpy(pGC->mqttPassword, pw);
                }
            }
        }
        else if (argNamei == "mqttclientuser"){
            const char *user = argi.c_str();
            if (strcmp(user, HiddenString) != 0){
                if (strcmp(user, pGC->mqttUser) != 0){
                    commit_required = true;
                    strcpy(pGC->mqttUser, user);
                }
            }
        }
        else if (argNamei == "mqttclienttxtopic"){
            const char *txtopic = argi.c_str();

            if (strcmp(txtopic, pGC->tx_topic) != 0){
                commit_required = true;
                strcpy(pGC->tx_topic, txtopic);
            }

        }
        else if (argNamei == "mqttclientrxtopic"){
            const char *rxtopic = argi.c_str();

            if (strcmp(rxtopic, pGC->rx_topic) != 0){
                commit_required = true;
                strcpy(pGC->rx_topic, rxtopic);
            }

        }
    }

    handleRoot();
    if (commit_required) {
        pGC->checksum = gc_checksum();
        EEPROM.commit();
        ESP.reset();
        delay(1000);
    }
}

#ifndef userpage_existing
    void handleconfigureUserWrite(){
        handleRoot();
    }
    void handleconfigureUser(){
        webServer.send_P(200, "text/html", USERPAGE_HTML);
    }
#else
    void handleconfigureUserWrite();
    void handleconfigureUser();
#endif

#ifndef userpage2_existing
    void handleconfigureUserWrite2(){
        handleRoot();
    }
    void handleconfigureUser2(){
        webServer.send_P(200, "text/html", USERPAGE_HTML);
    }
#else
    void handleconfigureUserWrite2();
    void handleconfigureUser2();
#endif

void webServersend_P(const char* html){
    webServer.send_P(200, "text/html", html);
}

void websock_setup(void) {
    webServer.on("/", handleRoot);
    webServer.on("/configDevice", HTTP_GET, handleconfigureDevice); //startpage
    webServer.on("/configMqtt", HTTP_GET, handleconfigureMqtt);
    webServer.on("/configMqtt", HTTP_POST, handleconfigureMqttWrite);
    webServer.on("/configDiv", HTTP_GET, handleconfigureDiv);
    webServer.on("/configDiv", HTTP_POST, handleconfigureDivWrite);
    webServer.on("/configReset", HTTP_GET, handleconfigureReset);
    webServer.on("/configReboot", HTTP_GET, handleReboot);
    webServer.on("/configWifiMan", HTTP_GET, handleResetWifiManager);
    webServer.on("/configUserPage", HTTP_GET, handleconfigureUser);
    webServer.on("/configUserPage", HTTP_POST, handleconfigureUserWrite);
    webServer.on("/configUserPage2", HTTP_GET, handleconfigureUser2);
    webServer.on("/configUserPage2", HTTP_POST, handleconfigureUserWrite2);
    webServer.onNotFound(handleNotFound);
    webServer.begin();

    webSocket.begin();
    webSocket.onEvent(webSocketEvent);
}

// ^^^^^^^^^ ESP8266 web sockets ^^^^^^^^^^^


// vvvvvvvvv ESP8266 Web OTA Updater vvvvvvvvvvv
#include <ESP8266HTTPUpdateServer.h>
ESP8266HTTPUpdateServer httpUpdater;

void ota_setup() {
    httpUpdater.setup(&webServer, "/updater", pGC->updateUser, pGC->updatePassword);//sw
}

// ^^^^^^^^^ ESP8266 Web OTA Updater ^^^^^^^^^^^



// vvvvvvvvv MQTT vvvvvvvvvvv
// *** Be sure to modify PubSubClient.h ***
//
// Be sure to increase the MQTT maximum packet size by modifying
// PubSubClient.h. Add the following line to the top of PubSubClient.h.
// Failure to make this modification means no MQTT messages will be
// published.
// #define MQTT_MAX_PACKET_SIZE 256




void mqtt_setup() {
    mqttClient.setServer(pGC->mqttbroker, 1883);
    mqttClient.setCallback(callback);
}
// If a UserSubscribe Funktion is declared we call it in the reconnect funktion


void reconnect() {
    
    static unsigned long timeLastConn = 0;
    static bool everConnected = false;
    

    // connect after 50s again
    if ((!timeLastConn) || ((timeLastConn + 100000) < millis())){
        timeLastConn = millis();
        //check WiFi Verbindung
        //Wenn wir schon mal verbunden waren und die Verbindung verlohren haben kann es auch am Wlan liegen. z.B. falscher AP wenn Repeater verbaut sind
        if (WiFi.status() == WL_CONNECTED){
            everConnected = true;
        }else if(everConnected){
            Serial.print("Try to Connect to WIFI again: ");
            //WiFi.disconnect();
            //delay(1000);
            Serial.println(wifiManager.connectWifi("","")); 
        }
        
        //check mqtt Verbindung
        if (!mqttClient.connected()) {
            if (strncmp(pGC->mqttbroker, "none", 4) != 0){
                Serial.print("Attempting MQTT connection...");
                // Attempt to connect
                if (mqttClient.connect(pGC->mqttclientname, pGC->mqttUser, pGC->mqttPassword)) {
                    delay(1000);
                    if (mqttClient.connected()) {
                        Serial.println("connected");
                        // Once connected, publish an announcement...
                        mqttClient.publish(DeviceName"_Info", "connected");
                        // ... and resubscribe
                        delay(1000);
                        #ifdef usersubscribe_existing
                            UserSubscribe();
                        #else                        
                            if (strlen(pGC->rx_topic)){
                                mqttClient.subscribe(pGC->rx_topic);
                                Serial.printf("subscribed to topic [%s]\r\n", pGC->rx_topic);
                            }else{
                                Serial.printf("Not subscribed to rx topic");
                            }
                        #endif
                    } else {
                        Serial.println("failed to connect to mqtt");
                    }
                } else {
                    Serial.print("failed, rc=");
                    Serial.print(mqttClient.state());
                    Serial.println(" try again in 100s");
                }
            }
        }
    }
}

void mqtt_loop() {

    reconnect();
    
