boaschti/ESP8266-Server/ESPServer.h
    mqttClient.loop();
}

void mqttpublishJSON(const char* key, const char* value){
    char payload[200] ="\"";
    strncat(payload, key, 100);
    strncat(payload, "\":\"", 10);
    strncat(payload, value, 100);
    strncat(payload, "\"", 10);
    mqttClient.publish(pGC->tx_topic, payload);
}

void mqttpublishTXTopic(const char* payload, boolean retained){
     mqttClient.publish(pGC->tx_topic, payload, retained);
}

void mqttpublish(const char* topic, const char* payload){
     mqttClient.publish(topic, payload);
}

void mqttpublish(const char* topic, const char* payload, boolean retained){
     mqttClient.publish(topic, payload, retained);
}

boolean mqttConnected(){
    return mqttClient.connected();
}

void mqttSubscribe(const char* topic){
    mqttClient.subscribe(topic);
}

void mqttUnsubscribe(const char* topic){
    mqttClient.unsubscribe(topic);
}

void mqttSubscribeSetTopic(){
    mqttClient.subscribe(pGC->rx_topic);
}

void mqttUnsubscribeSetTopic(){
    mqttClient.unsubscribe(pGC->rx_topic);
}

void mqttSubscribeStateTopic(){
    mqttClient.subscribe(pGC->tx_topic);
}

void mqttUnsubscribeStateTopic(){
    mqttClient.unsubscribe(pGC->tx_topic);
}

// ^^^^^^^^^ MQTT ^^^^^^^^^^^


// Start webserver, ota, mqtt ect complete

void setup_server(){
    
    if (!Serial){
        Serial.begin(SERIAL_BAUD);
    }
    Serial.println("eeprom_setup");
    eeprom_setup();
    Serial.println("wifi_setup");
    wifi_setup();
    Serial.println("mdns_setup");
    mdns_setup();
    Serial.println("mqtt_setup");
    mqtt_setup();
    Serial.println("ota_setup");
    ota_setup();
    Serial.println("websock_setup");
    websock_setup();
    Serial.println("webserver_setup_finished");
    
}

void loop_server(){
  
    mqtt_loop();
    //Serial.println("webSocket");
    webSocket.loop();
    //Serial.println("webServer");
    webServer.handleClient();
}

